---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.VerticalExtent
source: html/66010980-e3e8-a408-8054-de8faaa6f142.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.VerticalExtent Property

Vertical extent of the camera's view, measured at target distance.

## Syntax (C#)
```csharp
public double VerticalExtent { get; set; }
```